#include <iostream>
using namespace std;

int main() {
    //二维数组定义方式
    //1. 定义数组名[行数][列数]
    // int arr[2][3];
    // arr[0][0] = 1;
    // arr[0][1] = 2;
    // arr[0][2] = 3;
    // arr[1][0] = 4;
    // arr[1][1] = 5;    
    // arr[1][2] = 6;

    //2. 定义数组名[行数][列数] = { {元素1, 元素2, 元素3}, {元素4, 元素5, 元素6} };
    // int arr2[2][3] = { {1, 2, 3}, {4, 5, 6} };

    //3.定义数组名[行数][列数] = {元素1, 元素2, 元素3, 元素4, 元素5, 元素6}
    // int arr3[2][3] = {1, 2, 3, 4, 5, 6};

    //4. 定义数组名[][列数] = {元素1, 元素2, 元素3, 元素4, 元素5, 元素6};
    int arr4[][3] = {1, 2, 3, 4, 5, 6};

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 3; j++) {
            cout << arr4[i][j] << " ";
        }
        cout << endl;
    }
    return 0;
}